Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblem1dNonWPCurve Property
 Divided Surface cannot be split by a one dimensional curve without workplane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSplitManagerProblem1dNonWPCurve { get; }
Public Shared ReadOnly Property DividedSurfaceSplitManagerProblem1dNonWPCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSplitManagerProblem1dNonWPCurve {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSplitManagerProblem1dNonWPCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace